gap> Y:=RegularCWComplex(K);
Regular CW-complex of dimension 2

gap> C:=ChainComplex(Y);
Chain complex of length 2 in characteristic 0 . 

gap> C!.dimension(0);
1
gap> C!.dimension(1);
0
gap> C!.dimension(2);
160
