gap> R1:=ResolutionSL2ZInvertedInteger(2,5);
Resolution of length 5 in characteristic 0 for SL(2,Z[1/2]) . 

gap> R2:=ResolutionGL2QuadraticIntegers(-2,5);
Resolution of length 5 in characteristic 0 for GL(2,O-2) . 
No contracting homotopy available. 

gap> R3:=ResolutionGL2QuadraticIntegers(2,5);
Resolution of length 5 in characteristic 0 for GL(2,O2) . 
No contracting homotopy available. 

gap> R4:=ResolutionPGL2QuadraticIntegers(2,5);
Resolution of length 5 in characteristic 0 for PGL(2,O2) . 
No contracting homotopy available. 

gap> R5:=ResolutionGL3QuadraticIntegers(-2,5);
Resolution of length 5 in characteristic 0 for GL(3,O-2) . 
No contracting homotopy available. 

gap> R6:=ResolutionPGL3QuadraticIntegers(-2,5);
Resolution of length 5 in characteristic 0 for PGL(3,O-2) . 
No contracting homotopy available. 

gap> R7:=ResolutionArithmeticGroup("PSL(4,Z)",3);
Resolution of length 3 in characteristic 0 for &lt;matrix group with 655 generators&gt; . 
No contracting homotopy available. 
