gap> A:=AbelianPcpGroup([0]);;AbelianInvariants(A);
[ 0 ]
gap> K:=EilenbergMacLaneSimplicialGroup(A,3,8);
Simplicial group of length 8

gap> C:=ChainComplexOfSimplicialGroup(K);
Chain complex of length 8 in characteristic 0 . 

gap> Homology(C,7);
[ 3 ]
