gap> Y:=ClassifyingSpaceFiniteGroup(CyclicGroup(2),4);
Regular CW-complex of dimension 4
gap> Y!.nrCells(0);                                   
5
gap> Y!.nrCells(1);
20
gap> Y!.nrCells(2);
40
gap> Y!.nrCells(3);                                   
40
gap> Y!.nrCells(4);
16
