gap> Y:=ClassifyingSpaceFiniteGroup(DihedralGroup(16),5);
Regular CW-complex of dimension 5
gap> Homology(Y,1);
[ 2, 2 ]
gap> Homology(Y,2);
[ 2 ]
gap> Homology(Y,3);
[ 2, 2, 8 ]
gap> Homology(Y,4);
[ 2, 2 ]
gap> Size(Y);
15289

