gap> F:=FreeGroup(2);;x:=F.1;;y:=F.2;;
gap> G:=F/[ x*y*x^-1*y^-1 ];;
gap> Y:=EquivariantTwoComplex(G);
Equivariant CW-complex of dimension 2

gap> C:=ChainComplexOfQuotient(Y);
Chain complex of length 2 in characteristic 0 . 

gap> Homology(C,0);
[ 0 ]
gap> Homology(C,1);
[ 0, 0 ]
gap> Homology(C,2);
[ 0 ]
gap> FundamentalGroupOfQuotient(Y);
&lt;fp group of size infinity on the generators [ f1, f2 ]&gt;
