gap> G:=SpaceGroup(3,9);;
gap> IsAlmostBieberbachGroup(Image(IsomorphismPcpGroup(G)));
true
gap> Y:=EquivariantEuclideanSpace(G,[0,0,0]);
Equivariant CW-complex of dimension 3

gap> Y!.dimension(0);
1
gap> Y!.dimension(1);
3
gap> Y!.dimension(2);
3
gap> Y!.dimension(3);
1
gap> C:=ChainComplexOfQuotient(Y);
Chain complex of length 3 in characteristic 0 . 

gap> Homology(C,0);
[ 0 ]
gap> Homology(C,1);
[ 0, 0 ]
gap> Homology(C,2);
[ 2, 0 ]
gap> Homology(C,3);
[  ]
