gap> P:=SimplifiedComplex(RegularCWComplex(ClosedSurface(-1)));
Regular CW-complex of dimension 2
gap> PP:=DirectProduct(P,P);;
gap> SPP:=Suspension(PP,100); 
Regular CW-complex of dimension 104
gap> A:=CohomologyRing(SPP,2); 
&lt;algebra of dimension 9 over GF(2)>
gap> List(Basis(A),x->Bockstein(A,x));
[ 0*v.1, v.4, v.6, 0*v.1, v.7+v.8, 0*v.1, v.9, v.9, 0*v.1 ]

