gap> K:=ClosedSurface(-2);;                
gap> K:=SimplifiedComplex(RegularCWComplex(K));;
gap> KKKK:=DirectProduct(K,K,K,K); 
Regular CW-complex of dimension 8
gap> Size(KKKK);
331776
gap> C:=ChainComplex(KKKK);;
gap> bk:=Bockstein(C,2,2);;
gap> Order(Kernel(bk));
1024
gap> Order(Image(bk)); 
262144
