gap> K:=QuillenComplex(SymmetricGroup(7),2);;
gap> Y:=RegularCWComplex(K);;
gap> CY:=ChainComplexOfRegularCWComplex(Y);
Chain complex of length 2 in characteristic 0 . 

gap> CX:=ChainComplex(Y);
Chain complex of length 2 in characteristic 0 . 

gap> equiv:=ChainComplexEquivalenceOfRegularCWComplex(Y);;
gap> f:=equiv[1];
Chain Map between complexes of length 2 . 

gap> g:=equiv[2];
Chain Map between complexes of length 2 .


gap> CY!.dimension(0);
1316
gap> CY!.dimension(1);
5565
gap> CY!.dimension(2);
4410
