gap> Y:=RegularCWComplex(SimplicialK3Surface());
Regular CW-complex of dimension 4

gap> Size(Y);
1704
gap> W:=SimplifiedComplex(Y);
Regular CW-complex of dimension 4

gap> Size(W);
774
