gap> Q:=QuadraticNumberField(-1);;
gap> Lfunction(Q,2)/(18*3.142);
0.0161957

gap> 1.0*Log(Product(AbelianInvariants(G)),10)/Norm(I);
0.00913432

gap> 1.0*Log(Product(Filtered(AbelianInvariants(GG),i->not i=0)),10)/Norm(II);
0.0136594

gap> 1.0*Log(Product(Filtered(AbelianInvariants(GGG),i->not i=0)),10)/Norm(III);
0.0120078
