gap> K:=ContractibleGcomplex("SL(2,Z)");
Non-free resolution in characteristic 0 for SL(2,Integers) . 

gap> gamma:=HAP_CongruenceSubgroupGamma0(39);;
gap> KK:=NonFreeResolutionFiniteSubgroup(K,gamma);
Non-free resolution in characteristic 0 for &lt;matrix group with 
18 generators&gt; . 

gap> C:=TensorWithRationals(KK);
gap> Homology(C,1);
9

gap> G:=HAP_CongruenceSubgroupGamma0(2^13-1);;
gap> IndexInSL2Z(G);
8192
gap> KK:=NonFreeResolutionFiniteSubgroup(K,G);;
gap> C:=TensorWithRationals(KK);;
gap> Homology(C,1);
1365
