gap> gamma:=HAP_CongruenceSubgroupGamma0(39);;
gap> p:=2;;N:=1;;h:=HeckeOperatorWeight2(gamma,p,N);;
gap> AbelianInvariants(Source(h));
[ 0, 0, 0, 0, 0, 0, 0, 0, 0 ]
gap> T2:=HomomorphismAsMatrix(h);;
gap> Display(T2);
[ [  -2,  -2,   2,   2,   1,   2,   0,   0,   0 ],
  [  -2,   0,   1,   2,  -2,   2,   2,   2,  -2 ],
  [  -2,  -1,   2,   2,  -1,   2,   1,   1,  -1 ],
  [  -2,  -1,   2,   2,   1,   1,   0,   0,   0 ],
  [  -1,   0,   0,   2,  -3,   2,   3,   3,  -3 ],
  [   0,   1,   1,   1,  -1,   0,   1,   1,  -1 ],
  [  -1,   1,   1,  -1,   0,   1,   2,  -1,   1 ],
  [  -1,  -1,   0,   2,  -3,   2,   1,   4,  -1 ],
  [   0,   1,   0,  -1,  -2,   1,   1,   1,   2 ] ]
gap> Eigenvalues(Rationals,T2);
[ 3, 1 ]

gap> p:=5;;N:=1;;h:=HeckeOperator(gamma,p,N);;
gap> T5:=HomomorphismAsMatrix(h);;
gap> Display(T5);
[ [  -1,  -1,   3,   4,   0,   0,   1,   1,  -1 ],
  [  -5,  -1,   5,   4,   0,   0,   3,   3,  -3 ],
  [  -2,   0,   4,   4,   1,   0,  -1,  -1,   1 ],
  [  -2,   0,   3,   2,  -3,   2,   4,   4,  -4 ],
  [  -4,  -2,   4,   4,   3,   0,   1,   1,  -1 ],
  [  -6,  -4,   5,   6,   1,   2,   2,   2,  -2 ],
  [   1,   5,   0,  -4,  -3,   2,   5,  -1,   1 ],
  [  -2,  -2,   2,   4,   0,   0,  -2,   4,   2 ],
  [   1,   3,   0,  -4,  -4,   2,   2,   2,   4 ] ]
gap> Eigenvalues(Rationals,T5);
[ 6, 2 ]

gap>T2*T5=T5*T2;
true
