gap> A:=[[0,2,0],[-3,0,0],[0,0,4]];;
gap> S:=SparseMat(A);
Sparse matrix with 3 rows and 3 columns in characteristic 0

gap> NamesOfComponents(S);
[ "mat", "characteristic", "rows", "cols" ]
gap> S!.mat;
[ [ [ 2, 2 ] ], [ [ 1, -3 ] ], [ [ 3, 4 ] ] ]

gap> B:=SparseMattoMat(S);
[ [ 0, 2, 0 ], [ -3, 0, 0 ], [ 0, 0, 4 ] ]
