gap> Q:=QuillenComplex(AlternatingGroup(8),2);
Simplicial complex of dimension 3.

gap> C:=ChainComplex(Q);
Chain complex of length 3 in characteristic 0 . 

gap> Size(Q);
55015
gap> Size(C);
55015
