gap> Q:=IntegerSimplicialComplex(Q);
Simplicial complex of dimension 3.

gap> L:=ContractibleSubcomplex(Q);
Simplicial complex of dimension 3.

gap> D:=ChainComplexOfPair(Q,L);
Chain complex of length 3 in characteristic 0 . 

gap> Size(D)=Size(Q)-Size(L);
true
gap> Size(D);
670
gap>
