gap> Circle:=PureCubicalComplex([[1,1,1,1,1],[1,1,0,1,1],[1,1,1,1,1]]);
Pure cubical complex of dimension 2.

gap> Torus:=DirectProductOfPureCubicalComplexes(Circle,Circle);
Pure cubical complex of dimension 4.

gap> CTorus:=CechComplexOfPureCubicalComplex(Torus);
Simplicial complex of dimension 15.

gap> Y:=RegularCWComplex(CTorus);
Regular CW-complex of dimension 15
