gap> C:=ChainComplexOfRegularCWComplex(Y);
Chain complex of length 15 in characteristic 0 . 

gap> Size(C);
1172776

gap> D:=ChainComplex(Y);
Chain complex of length 15 in characteristic 0 . 

gap> Size(D);
4
