gap> K:=PurePermutahedralKnot(11,1);;
gap> M:=PureComplexComplement(K);
Pure permutahedral complex of dimension 3.

gap> Y:=RegularCWComplex(M);
Regular CW-complex of dimension 3

gap> f:=BoundaryMap(Y);
Map of regular CW-complexes

gap> F:=ChainMap(f);
Chain Map between complexes of length 2 . 

gap> H:=Homology(F,1);
[ g1, g2 ] -> [ g1^-1, g1^-1 ]

gap> Kernel(H);
Pcp-group with orders [ 0 ]
