gap> R:=ResolutionFiniteGroup(SymmetricGroup(5),5);;
gap> S:=ResolutionFiniteSubgroup(R,AlternatingGroup(4));
Resolution of length 5 in characteristic 0 for Alt( [ 1 .. 4 ] ) . 

gap> Size(S);
[ 80, 380, 1000, 2040, 3400 ]
gap> T:=SimplifiedComplex(S);
Resolution of length 5 in characteristic 0 for Alt( [ 1 .. 4 ] ) . 

gap> Size(T);
[ 4, 34, 22, 19, 196 ]
