gap> Hopf:=PureCubicalLink("Hopf");
Pure cubical link.

gap> Y:=SpunAboutInitialHyperplane(PureComplexComplement(Hopf));
Regular CW-complex of dimension 3

gap> Homology(Y,0);
[ 0 ]
gap> Homology(Y,1);
[ 0, 0 ]
gap> Homology(Y,2);
[ 0, 0, 0, 0 ]
gap> Homology(Y,3);
[ 0, 0 ]
gap> Homology(Y,4);
[  ]
gap> GY:=FundamentalGroup(Y);;
gap> GeneratorsOfGroup(GY);
[ f2, f3 ]
gap> RelatorsOfFpGroup(GY);
[ f3^-1*f2^-1*f3*f2 ]
