gap> L:=HopfSatohSurface();
Pure cubical complex of dimension 4.

gap> W:=ContractedComplex(RegularCWComplex(PureComplexComplement(L)));
Regular CW-complex of dimension 3

gap> Homology(W,0);
[ 0 ]
gap> Homology(W,1);
[ 0, 0 ]
gap> Homology(W,2);
[ 0, 0, 0, 0 ]
gap> Homology(W,3);
[ 0, 0 ]
gap> Homology(W,4);
[  ]

gap> GW:=FundamentalGroup(W);;
gap> GeneratorsOfGroup(GW);
[ f1, f2 ]
gap> RelatorsOfFpGroup(GW);
[ f1^-1*f2^-1*f1*f2 ]
