gap> Y:=RegularCWComplex(K);
Regular CW-complex of dimension 19

gap> Homology(Y,0);
[ 0 ]
gap> Homology(Y,1);
[ 0 ]
gap> Homology(Y,2);
[  ]
gap> Homology(Y,3);
[  ]
gap> Homology(Y,4);
[  ]
gap> Homology(Y,5)
[  ]
