gap> Y:=SimplicialComplexToRegularCWComplex(K,6);
Regular CW-complex of dimension 6
gap> Homology(Y,0);
[ 0 ]
gap> Homology(Y,1);
[ 0 ]
gap> Homology(Y,2);
[  ]
gap> Homology(Y,3);
[  ]
gap> Homology(Y,4);
[  ]

