gap> G:=Image(NqEpimorphismNilpotentQuotient(FreeGroup(2),5));;
gap> L:=LowerCentralSeriesLieAlgebra(G);;
gap> Collected( LieAlgebraHomology(L,4) );
[ [ 0, 85 ], [ 7, 1 ] ]
gap> Collected( GroupHomology(G,4) );
[ [ 0, 85 ], [ 7, 1 ] ]

gap> G:=Image(NqEpimorphismNilpotentQuotient(FreeGroup(4),2));;  
gap> L:=LowerCentralSeriesLieAlgebra(G);;
gap> Collected( LieAlgebraHomology(L,4) );
[ [ 0, 84 ], [ 3, 4 ] ]
gap> Collected( GroupHomology(G,4) );
[ [ 0, 84 ], [ 3, 4 ] ]
