gap> A:=SimpleLieAlgebra("B",7,Integers);       
&lt;Lie algebra of dimension 105 over Integers>
gap> C:=ChevalleyEilenbergComplex(A,4,"sparse");
Sparse chain complex of length 4 in characteristic 0 . 

gap> D:=ContractedComplex(C);
Sparse chain complex of length 4 in characteristic 0 . 

gap> Collected(Homology(D,3));
[ [ 0, 1 ], [ 2, 105 ] ]
