gap> CC:=ChainComplexOfRegularCWComplex(Y);
Chain complex of length 2 in characteristic 0 . 

gap> CC!.dimension(0);
1316
gap> CC!.dimension(1);
5565
gap> CC!.dimension(2);
4410
