gap> FL:=[];; #The face lattice
gap> FL[1]:=[[1,0],[1,0],[1,0],[1,0]];;
gap> FL[2]:=[[2,1,2],[2,3,4],[2,1,4],[2,2,3],[2,1,4],[2,2,3]];;
gap> FL[3]:=[[4,1,2,3,4],[4,1,2,5,6]];;
gap> FL[4]:=[];;
gap> A:=RegularCWComplex(FL);
Regular CW-complex of dimension 2

gap> Homology(A,0);
[ 0 ]
gap> Homology(A,1);
[ 0 ]
gap> Homology(A,2);
[  ]

