gap> Y:=PureComplexComplement(M);
Pure cubical complex of dimension 3.

gap> Size(Y);
5891

gap> YY:=ZigZagContractedComplex(Y);
Pure cubical complex of dimension 3.

gap> Size(YY);
775

gap> W:=RegularCWComplex(YY);
Regular CW-complex of dimension 3

gap> Size(W);
11939

gap> WW:=ContractedComplex(W);
Regular CW-complex of dimension 2

gap> Size(WW);
5993

gap> G:=FundamentalGroup(WW);
&lt;fp group of size infinity on the generators [ f1, f2, f3 ]>

gap> AlexanderPolynomial(G);
x_1^4-2*x_1^3+3*x_1^2-2*x_1+1

