gap> C:=AutomorphismGroupAsCatOneGroup(DihedralGroup(10));
Cat-1-group with underlying group Group( [ f1, f2, f3, f4, f5 ] ) . 

gap> Order(C);
200
gap> IdCatOneGroup(C);
[ 200, 42, 4 ]
gap> 
gap> IdQuasiCatOneGroup(C);
[ 2, 1 ]
gap> D:=SmallCatOneGroup(2,1);
Cat-1-group with underlying group Group( [ f1 ] ) . 
